# Übung 12 - Pandas Recap 3

Arbeiten Sie nachfolgenden Aufgabenstellungen durch und dokumentieren Sie, wenn notwendig, ihre Erkenntnisse.

In [1]:
import pandas as pd

## Task 12.1

Erstellen Sie a) das DataFrame `person_df` mit folgendem Inhalt:

<table>
    <tr><th></th><th>Gewicht</th><th>Größe</th></tr>
     <tr><td>Henry</td><td>75</td><td>179</td></tr>
    <tr><td>Sarah</td><td>68</td><td>165</td></tr>
    <tr><td>Elke</td><td>68</td><td>172</td></tr>
    <tr><td>Susi</td><td>55</td><td>164</td></tr>
    <tr><td>Vera</td><td>58</td><td>160</td></tr>
    <tr><td>Toni</td><td>99</td><td>189</td></tr>
    <tr><td>Maria</td><td>68</td><td>176</td></tr>
    <tr><td>Chris</td><td>60</td><td>175</td></tr>    
</table>

In [3]:
persons = { "Name" : ["Henry", "Sarah", "Elke",
                      "Susi", "Vera", "Toni",
                      "Maria", "Chris"],
            "Größe" : [179, 165, 172, 164, 160,
                       189, 176, 175],
            "Gewicht" : [75, 68, 68, 55, 58, 99, 68, 60]
           }

person_df = pd.DataFrame(persons)
person_df

    Name  Größe  Gewicht
0  Henry    179       75
1  Sarah    165       68
2   Elke    172       68
3   Susi    164       55
4   Vera    160       58
5   Toni    189       99
6  Maria    176       68
7  Chris    175       60

Der sog. *Body Mass Index* [1] berechnet sich durch:

$$
BMI = \frac{\text{Gewicht in Kilogramm}}{\left(\text{Größe in Metern}\right)^2}
$$


Berechnen Sie b) den BMI für alle Personen des DataFrames `person_df` und geben Sie ausschließlich jene aus, deren BMI > 20 und < 25 ist. 

**Hinweis**: Erstellen Sie KEINE neue Spalte im DataFrame. Es ist ausschließlich folgendes Ergebnis in der Zelle auszugeben:

```Python
Henry    23.407509 
Sarah    24.977043 
Elke     22.985398  
Susi     20.449137  
Vera     22.656250  
Maria    21.952479
dtype: float64
``` 
[1] https://de.wikipedia.org/wiki/Body-Mass-Index

In [17]:
bmi = pd.DataFrame()
bmi["Names"] = person_df["Name"]
bmi["BMI"] = person_df["Gewicht"] / (person_df["Größe"] / 100) ** 2
bmi[(bmi["BMI"] > 20) & (bmi["BMI"] < 25)]

   Names        BMI
0  Henry  23.407509
1  Sarah  24.977043
2   Elke  22.985398
3   Susi  20.449137
4   Vera  22.656250
6  Maria  21.952479

Nachdem die Berechnung erfolgreich war, fügen Sie c) die ermittelten Werte (je Person) dem DataFrame `person_df` hinzu. Als Spaltenname ist *BMI* zu wählen.

In [18]:
person_df["BMI"] = bmi["BMI"]
person_df

    Name  Größe  Gewicht        BMI
0  Henry    179       75  23.407509
1  Sarah    165       68  24.977043
2   Elke    172       68  22.985398
3   Susi    164       55  20.449137
4   Vera    160       58  22.656250
5   Toni    189       99  27.714790
6  Maria    176       68  21.952479
7  Chris    175       60  19.591837

Geben Sie d) das erzeugte DataFrame absteigend sortiert nach dem BMI aus.

In [19]:
person_df.sort_values("BMI", ascending=False)

    Name  Größe  Gewicht        BMI
5   Toni    189       99  27.714790
1  Sarah    165       68  24.977043
0  Henry    179       75  23.407509
2   Elke    172       68  22.985398
4   Vera    160       58  22.656250
6  Maria    176       68  21.952479
3   Susi    164       55  20.449137
7  Chris    175       60  19.591837

## Task 12.2

Laden Sie das bereitgestellte Dataset *parks.csv* und verschaffen Sie sich einen Überblick über dessen Aufbau bzw. Inhalt.

In [ ]:
park_df = pd.read_csv("parks.csv")
park_df

In [21]:
park_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56 entries, 0 to 55
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Park Code  56 non-null     object
 1   Park Name  56 non-null     object
 2   State      56 non-null     object
 3   Acres      56 non-null     int64
 4   Latitude   56 non-null     float64
 5   Longitude  56 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 2.8+ KB

a) Geben Sie den Park mit der ID 9 aus:

b) Geben Sie Parks mit der ID 3, 12 und 24 aus:

In [8]:
#b)

c) Wie ist das DataFrame `park_df` zu ändern, dass die Abfrage `park_df.loc['BIBE']` durchläuft und somit folgendes Ergebnis liefert:

```Python
Park Name    Big Bend National Park
State                            TX
Acres                        801163
Latitude                      29.25
Longitude                   -103.25
Name: BIBE, dtype: object
```

In [9]:
#c)

d) Geben Sie die ersten drei sowie den 4., 5. und 6 Park aus (zwei separate Anfragen mit `iloc`):

In [10]:
#d)

e) Gesucht ist folgende Ausgabe der Spalte *Park Code*:

```Python
0    ACAD
1    ARCH
2    BADL
Name: Park Code, dtype: object
```

In [11]:
#e)

Spaltennamen mit Leerzeichen (und Großbuchstaben) sind eine potenzielle Fehlerquelle, die es zu eliminieren gilt. Ändern Sie f) die Spaltennamen durch den Einsatz von `replace(...)` und `lower(...)` in einer *List Comprehension*. **Wichtig**: Die Liste mit den neuen Spaltennamen ist in der *List Comprehension* zu erstellen. Warum wir eine Liste benötigen, ist durch das Property *columns* von *DataFrame* definiert. `new_column_names` gestaltet sich nach Abarbeitung der *List Comprehension* wie folgt:

```Python
['parkcode', 'parkname', 'state', 'acres', 'latitude', 'longitude']
```

In [12]:
#f)

Selektieren Sie g) den Parknamen und den Bundestaat der ersten 3 Zeilen im *DataFrame*.

In [13]:
#g)

h) Worin unterscheiden sich diese beiden Abfragen und was wäre eine logische Erklärung dafür?
- `park_df.iloc[2]`
- `park_df.iloc[[2]]`

In [15]:
# h)

i) Welche Parks befinden sich im Bundesstaat Utah (UT)?

In [16]:
#i)

j) Welche Parks erfüllen folgende Bedingung? 
- latitude > 60 oder acres > 1.000.000

In [17]:
#j)

k) Finden Sie alle Parks, die sich in den Bundesstaaten *WA*, *OR* und *CA* befinden. Verwenden Sie hierzu `isin()` (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.isin.html?highlight=isin#pandas.DataFrame.isin)

In [18]:
#k)